<a href="https://colab.research.google.com/github/dcmoura/ipython-spyql/blob/master/examples/writers.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
%load_ext sql

In [ ]:
%sql sqlite://

'Connected: @None'

In [ ]:
%%sql
CREATE TABLE writer (first_name, last_name, year_of_death);
INSERT INTO writer VALUES ('William', 'Shakespeare', 1616);
INSERT INTO writer VALUES ('Bertold', 'Brecht', 1956);

 * sqlite://
(sqlite3.OperationalError) table writer already exists
[SQL: CREATE TABLE writer (first_name, last_name, year_of_death);]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [ ]:
%sql select * from writer

 * sqlite://
Done.

[('William', 'Shakespeare', 1616), ('Bertold', 'Brecht', 1956)]

In [ ]:
%%sql writers << select first_name, year_of_death
from writer

 * sqlite://
Done.
Returning data to local variable writers

In [ ]:
writers

[('William', 1616), ('Bertold', 1956)]

In [ ]:
var = 'last_name'

In [ ]:
%sql select * from writer where {var} = 'Brecht'

 * sqlite://
Done.

[('Bertold', 'Brecht', 1956)]

In [ ]:
%%sql select * from writer 
where {var} = 'Brecht'

 * sqlite://
Done.

[('Bertold', 'Brecht', 1956)]

In [1]:
a = 1 + 3
a

4